; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph3 - mode
	infrared4 - mode
	spectrograph0 - mode
	thermograph1 - mode
	image2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Planet26 - direction
	Planet27 - direction
	Phenomenon28 - direction
	Phenomenon29 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet23)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument7 infrared4)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Planet13)
	(pointing satellite2 Phenomenon18)
	(pointing satellite3 Phenomenon29)
	(pointing satellite4 Phenomenon8)
	(have_image Planet6 spectrograph0)
	(have_image Phenomenon7 image2)
	(have_image Star9 thermograph3)
	(have_image Phenomenon11 infrared4)
	(have_image Phenomenon12 image2)
	(have_image Planet13 infrared4)
	(have_image Planet15 image2)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 image2)
	(have_image Phenomenon18 spectrograph0)
	(have_image Phenomenon19 thermograph3)
	(have_image Star20 thermograph1)
	(have_image Star21 spectrograph0)
	(have_image Planet23 infrared4)
	(have_image Phenomenon24 thermograph3)
	(have_image Star25 thermograph1)
	(have_image Planet26 infrared4)
	(have_image Planet27 infrared4)
	(have_image Phenomenon28 spectrograph0)
	(have_image Phenomenon29 thermograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 24
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 24
3. (turn_to satellite4 groundstation4 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 24
4. (calibrate satellite4 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 24
5. (turn_to satellite3 phenomenon29 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon29)
   goals met: 1 of 24
6. (turn_to satellite2 groundstation0 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 24
7. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 24
8. (turn_to satellite2 phenomenon18 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon18)
   goals met: 2 of 24
9. (take_image satellite2 phenomenon18 instrument3 spectrograph0)
   added: (have_image phenomenon18 spectrograph0)
   goals met: 3 of 24
10. (turn_to satellite1 planet13 planet23)
   deleted: (pointing satellite1 planet23)
   added: (pointing satellite1 planet13)
   goals met: 4 of 24
11. (turn_to satellite2 phenomenon28 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon28)
   goals met: 3 of 24
12. (take_image satellite2 phenomenon28 instrument3 spectrograph0)
   added: (have_image phenomenon28 spectrograph0)
   goals met: 4 of 24
13. (turn_to satellite2 phenomenon18 phenomenon28)
   deleted: (pointing satellite2 phenomenon28)
   added: (pointing satellite2 phenomenon18)
   goals met: 5 of 24
14. (turn_to satellite2 planet6 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 planet6)
   goals met: 4 of 24
15. (take_image satellite2 planet6 instrument3 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 5 of 24
16. (turn_to satellite2 phenomenon18 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon18)
   goals met: 6 of 24
17. (turn_to satellite2 star21 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 star21)
   goals met: 5 of 24
18. (take_image satellite2 star21 instrument3 spectrograph0)
   added: (have_image star21 spectrograph0)
   goals met: 6 of 24
19. (turn_to satellite2 phenomenon18 star21)
   deleted: (pointing satellite2 star21)
   added: (pointing satellite2 phenomenon18)
   goals met: 7 of 24
20. (turn_to satellite4 phenomenon11 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon11)
   goals met: 7 of 24
21. (take_image satellite4 phenomenon11 instrument7 infrared4)
   added: (have_image phenomenon11 infrared4)
   goals met: 8 of 24
22. (turn_to satellite4 groundstation4 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 groundstation4)
   goals met: 8 of 24
23. (turn_to satellite4 phenomenon16 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon16)
   goals met: 8 of 24
24. (take_image satellite4 phenomenon16 instrument7 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 9 of 24
25. (turn_to satellite4 groundstation4 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 groundstation4)
   goals met: 9 of 24
26. (turn_to satellite4 phenomenon19 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon19)
   goals met: 9 of 24
27. (take_image satellite4 phenomenon19 instrument7 thermograph3)
   added: (have_image phenomenon19 thermograph3)
   goals met: 10 of 24
28. (turn_to satellite4 groundstation4 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 groundstation4)
   goals met: 10 of 24
29. (switch_off instrument7 satellite4)
   deleted: (power_on instrument7)
   added: (power_avail satellite4)
   goals met: 10 of 24
30. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 10 of 24
31. (calibrate satellite4 instrument9 groundstation4)
   added: (calibrated instrument9)
   goals met: 10 of 24
32. (switch_off instrument9 satellite4)
   deleted: (power_on instrument9)
   added: (power_avail satellite4)
   goals met: 10 of 24
33. (switch_on instrument7 satellite4)
   deleted: (calibrated instrument7) (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 10 of 24
34. (calibrate satellite4 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 10 of 24
35. (turn_to satellite4 phenomenon12 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon12)
   goals met: 10 of 24
36. (turn_to satellite4 phenomenon24 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon24)
   goals met: 10 of 24
37. (take_image satellite4 phenomenon24 instrument7 thermograph3)
   added: (have_image phenomenon24 thermograph3)
   goals met: 11 of 24
38. (turn_to satellite4 phenomenon12 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 phenomenon12)
   goals met: 11 of 24
39. (turn_to satellite4 phenomenon29 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon29)
   goals met: 11 of 24
40. (take_image satellite4 phenomenon29 instrument7 thermograph1)
   added: (have_image phenomenon29 thermograph1)
   goals met: 12 of 24
41. (turn_to satellite4 phenomenon12 phenomenon29)
   deleted: (pointing satellite4 phenomenon29)
   added: (pointing satellite4 phenomenon12)
   goals met: 12 of 24
42. (turn_to satellite4 planet13 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet13)
   goals met: 12 of 24
43. (take_image satellite4 planet13 instrument7 infrared4)
   added: (have_image planet13 infrared4)
   goals met: 13 of 24
44. (turn_to satellite4 phenomenon12 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 phenomenon12)
   goals met: 13 of 24
45. (turn_to satellite4 planet23 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet23)
   goals met: 13 of 24
46. (take_image satellite4 planet23 instrument7 infrared4)
   added: (have_image planet23 infrared4)
   goals met: 14 of 24
47. (turn_to satellite4 phenomenon12 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 phenomenon12)
   goals met: 14 of 24
48. (turn_to satellite4 planet26 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet26)
   goals met: 14 of 24
49. (take_image satellite4 planet26 instrument7 infrared4)
   added: (have_image planet26 infrared4)
   goals met: 15 of 24
50. (turn_to satellite4 phenomenon12 planet26)
   deleted: (pointing satellite4 planet26)
   added: (pointing satellite4 phenomenon12)
   goals met: 15 of 24
51. (turn_to satellite4 planet27 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet27)
   goals met: 15 of 24
52. (take_image satellite4 planet27 instrument7 infrared4)
   added: (have_image planet27 infrared4)
   goals met: 16 of 24
53. (turn_to satellite4 phenomenon12 planet27)
   deleted: (pointing satellite4 planet27)
   added: (pointing satellite4 phenomenon12)
   goals met: 16 of 24
54. (turn_to satellite4 star20 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star20)
   goals met: 16 of 24
55. (take_image satellite4 star20 instrument7 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 17 of 24
56. (turn_to satellite4 phenomenon12 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 phenomenon12)
   goals met: 17 of 24
57. (turn_to satellite4 star25 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star25)
   goals met: 17 of 24
58. (take_image satellite4 star25 instrument7 thermograph1)
   added: (have_image star25 thermograph1)
   goals met: 18 of 24
59. (turn_to satellite4 phenomenon12 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 phenomenon12)
   goals met: 18 of 24
60. (turn_to satellite4 star9 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star9)
   goals met: 18 of 24
61. (take_image satellite4 star9 instrument7 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 19 of 24
62. (switch_off instrument7 satellite4)
   deleted: (power_on instrument7)
   added: (power_avail satellite4)
   goals met: 19 of 24
63. (turn_to satellite4 phenomenon12 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon12)
   goals met: 19 of 24
64. (switch_on instrument9 satellite4)
   deleted: (calibrated instrument9) (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 19 of 24
65. (turn_to satellite4 groundstation4 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 groundstation4)
   goals met: 19 of 24
66. (calibrate satellite4 instrument9 groundstation4)
   added: (calibrated instrument9)
   goals met: 19 of 24
67. (turn_to satellite4 phenomenon12 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon12)
   goals met: 19 of 24
68. (take_image satellite4 phenomenon12 instrument9 image2)
   added: (have_image phenomenon12 image2)
   goals met: 20 of 24
69. (turn_to satellite4 phenomenon7 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon7)
   goals met: 20 of 24
70. (take_image satellite4 phenomenon7 instrument9 image2)
   added: (have_image phenomenon7 image2)
   goals met: 21 of 24
71. (turn_to satellite4 phenomenon8 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon8)
   goals met: 22 of 24
72. (turn_to satellite4 planet15 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet15)
   goals met: 21 of 24
73. (take_image satellite4 planet15 instrument9 image2)
   added: (have_image planet15 image2)
   goals met: 22 of 24
74. (turn_to satellite4 phenomenon8 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 phenomenon8)
   goals met: 23 of 24
75. (turn_to satellite4 star17 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star17)
   goals met: 22 of 24
76. (take_image satellite4 star17 instrument9 image2)
   added: (have_image star17 image2)
   goals met: 23 of 24
77. (turn_to satellite4 phenomenon8 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 phenomenon8)
   goals met: 24 of 24
